In [1]:
import pandas as pd
import numpy as np

In [2]:
# tekrar

# DataFrame

In [3]:
# listeden DataFrame üretimi

In [4]:
df=pd.DataFrame([1,5,6,9])

In [5]:
df

   0
0  1
1  5
2  6
3  9

In [6]:
df1=pd.DataFrame([1,5,6,9],index=["a","b","a","b"],columns=["type"])    # index ve columns verebiliyoruz

In [7]:
df1

   type
a     1
b     5
a     6
b     9

In [8]:
# dictionary den DataFrame üretimi

In [56]:
dicti={"name":["ali","veli","ahmet"], "age":[25,30,18]} # dictionary lerde key değerleri columns ları belirtir ve string ifade 
                                                        # olması beklenir. liste formatındaki value değerleri ise DataFrame
                                                        # in  sütünlarını doldurur yani değerlerini oluşturur

In [61]:
df1=pd.DataFrame(dicti)

In [62]:
df1

    name  age
0    ali   25
1   veli   30
2  ahmet   18

In [72]:
df11=pd.DataFrame(dicti, index=["x","y","z"])                     # index değerlerini belirleyebiliyoruz

In [73]:
df11

    name  age
x    ali   25
y   veli   30
z  ahmet   18

In [74]:
df111=pd.DataFrame(dicti, index=["x","y","z"], columns=["name"])   # tamamını değilde istenilen key değeri sütunlarda alınabilir

In [75]:
df111

    name
x    ali
y   veli
z  ahmet

In [14]:
# dictionary lerden oluşan bir listeden DataFrame üretimi 
# (liste içerisinde bir cok dictioanery bulunur. dicitonaryler birbiriyle uyumlu olmalı)

In [79]:
data=[{"a":1,"b":2},{"a":1,"c":5,"d":10}]           # iki dictinary den oluşan bir listeden DataFrame yapılacak. key değerleri
                                                    # columns ların adlarını oluşturuyor. dictionarylerde aynı key değerlerinin
                                                    # value leri alt alta yazılır. ortak olmayan key değerleri için value değeri
                                                    # yoksa nan yazılır

In [80]:
df2=pd.DataFrame(data)

In [81]:
df2

   a    b    c     d
0  1  2.0  NaN   NaN
1  1  NaN  5.0  10.0

In [82]:
data

[{'a': 1, 'b': 2}, {'a': 1, 'c': 5, 'd': 10}]

In [68]:
df22=pd.DataFrame(data,columns=["a","d"])          # eğer columns değerleri verilirse sadece bu columns lardan oluşan bir 
                                                   # DataFrame oluşturulur.

In [69]:
df22

   a     d
0  1   NaN
1  1  10.0

In [21]:
# np.array den DataFrame üretimi

In [86]:
df3=pd.DataFrame(np.array([[1,5,8],[1,3,6]]),columns=["a","b","c"], index=["x","y"])

In [87]:
df3

   a  b  c
x  1  5  8
y  1  3  6

In [24]:
# pd.Series lerden DataFrame üretimi

In [93]:
d = {'one' : pd.Series([1, 2, 3]),
   'two' : pd.Series([1, 2, 3, 4])}            # bir dictionary nin value değerleri pd.Series lerden olusuyor. index değerleri
                                               # verilmezse otomatik atanır. verilirse onlar üzerinden calışır
                                               # key değerleri columns ları oluşturur

In [94]:
df4=pd.DataFrame(d)

In [95]:
df4

   one  two
0  1.0    1
1  2.0    2
2  3.0    3
3  NaN    4

In [96]:
dd = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

In [97]:
df44=pd.DataFrame(dd)

In [98]:
df44

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [31]:
# random degerler üretilmiş bir array den DataFrame üretimi

In [99]:
df5=pd.DataFrame(np.random.randn(7,3))      # np.random.randn(7,3) istenilen boyutlarda random değerler atayarak DataFrame yapar

In [100]:
df5

          0         1         2
0 -0.057842  0.293305 -1.660581
1 -0.248246  0.090050  0.007751
2  0.290637 -1.473511 -0.255039
3 -0.795189  1.308951  0.198712
4 -0.361226 -0.754061 -0.430421
5 -0.918484 -0.848877 -1.347661
6  0.961628 -0.511746 -2.080009

In [103]:
df55=pd.DataFrame(np.random.randn(7,3), index=[11,22,33,44,55,66,77], columns=["a","b","c"])

In [104]:
df55

           a         b         c
11  0.407003  0.631475 -0.371072
22  1.985649 -0.496804 -0.676871
33 -1.358704  0.309685  1.008129
44  1.348864 -1.331916 -2.000455
55 -0.291683 -1.562636 -1.260598
66 -0.153917  0.537759  0.112920
77 -0.592685 -0.799733  0.207916

In [36]:
# kompleks değerlerden oluşan bir DataFrame üretimi. key değerlerinin karşılıkları farklı yontemlerle oluşturuldu

In [143]:
N=20
df6=pd.DataFrame({
                    "tarih":pd.date_range("2021-01-01",periods=N, freq="D"),
                    "lineer sayi":np.linspace(0,N-1, num=N),
                    "rastgele_sayi":np.random.rand(N),
                    "size":np.random.choice(["LOW","MEDİUM","HIGH"],N).tolist(),
                    "normal_sayi":np.random.normal(100,10, size=(N)).tolist(),

})

In [144]:
df6

        tarih  lineer sayi  rastgele_sayi    size  normal_sayi
0  2021-01-01          0.0       0.048544    HIGH   104.476331
1  2021-01-02          1.0       0.898854  MEDİUM   103.052792
2  2021-01-03          2.0       0.320343     LOW   103.019406
3  2021-01-04          3.0       0.478690    HIGH    90.197800
4  2021-01-05          4.0       0.300627  MEDİUM   112.133651
5  2021-01-06          5.0       0.934993  MEDİUM    97.372935
6  2021-01-07          6.0       0.720346     LOW    88.834921
7  2021-01-08          7.0       0.653643     LOW    96.306157
8  2021-01-09          8.0       0.026597     LOW   100.646111
9  2021-01-10          9.0       0.206372  MEDİUM    91.331152
10 2021-01-11         10.0       0.581753     LOW    84.104568
11 2021-01-12         11.0       0.672362  MEDİUM    92.607332
12 2021-01-13         12.0       0.720456     LOW    85.619529
13 2021-01-14         13.0       0.424205  MEDİUM   110.826395
14 2021-01-15         14.0       0.219905  MEDİUM   113.047675
15 2021-01-16         15.0       0.928297     LOW    93.939757
16 2021-01-17         16.0       0.968378     LOW   105.362962
17 2021-01-18         17.0       0.943751    HIGH    73.083532
18 2021-01-19         18.0       0.427737    HIGH    93.793064
19 2021-01-20         19.0       0.784013    HIGH    88.438203

In [145]:
df6.shape

(20, 5)

In [146]:
df6.ndim

2

In [147]:
df6.axes

[RangeIndex(start=0, stop=20, step=1),
 Index(['tarih', 'lineer sayi', 'rastgele_sayi', 'size', 'normal_sayi'], dtype='object')]

In [148]:
df6.values

array([[Timestamp('2021-01-01 00:00:00'), 0.0, 0.048543690980328624,
        'HIGH', 104.4763310695392],
       [Timestamp('2021-01-02 00:00:00'), 1.0, 0.8988542744480201,
        'MEDİUM', 103.05279180411763],
       [Timestamp('2021-01-03 00:00:00'), 2.0, 0.3203430894016519, 'LOW',
        103.0194064378686],
       [Timestamp('2021-01-04 00:00:00'), 3.0, 0.4786897753303263,
        'HIGH', 90.19779973700625],
       [Timestamp('2021-01-05 00:00:00'), 4.0, 0.300626581137861,
        'MEDİUM', 112.13365096133892],
       [Timestamp('2021-01-06 00:00:00'), 5.0, 0.9349930527172482,
        'MEDİUM', 97.37293473460123],
       [Timestamp('2021-01-07 00:00:00'), 6.0, 0.7203458922499019, 'LOW',
        88.83492105157528],
       [Timestamp('2021-01-08 00:00:00'), 7.0, 0.6536429041142359, 'LOW',
        96.30615732549495],
       [Timestamp('2021-01-09 00:00:00'), 8.0, 0.02659712617464982,
        'LOW', 100.64611148287594],
       [Timestamp('2021-01-10 00:00:00'), 9.0, 0.2063715948818351,
        'MEDİUM', 91.33115226708058],
       [Timestamp('2021-01-11 00:00:00'), 10.0, 0.5817530818158245,
        'LOW', 84.10456820897932],
       [Timestamp('2021-01-12 00:00:00'), 11.0, 0.6723623916872664,
        'MEDİUM', 92.60733235382881],
       [Timestamp('2021-01-13 00:00:00'), 12.0, 0.7204559647831302,
        'LOW', 85.61952927950232],
       [Timestamp('2021-01-14 00:00:00'), 13.0, 0.4242053299444627,
        'MEDİUM', 110.82639526164361],
       [Timestamp('2021-01-15 00:00:00'), 14.0, 0.2199050855128578,
        'MEDİUM', 113.04767475527723],
       [Timestamp('2021-01-16 00:00:00'), 15.0, 0.9282966962191297,
        'LOW', 93.93975683297718],
       [Timestamp('2021-01-17 00:00:00'), 16.0, 0.9683781666427236,
        'LOW', 105.36296186854179],
       [Timestamp('2021-01-18 00:00:00'), 17.0, 0.9437509440066676,
        'HIGH', 73.08353237808768],
       [Timestamp('2021-01-19 00:00:00'), 18.0, 0.42773688680355404,
        'HIGH', 93.79306394501283],
       [Timestamp('2021-01-20 00:00:00'), 19.0, 0.784012863950023,
        'HIGH', 88.43820328474801]], dtype=object)

In [149]:
df6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tarih          20 non-null     datetime64[ns]
 1   lineer sayi    20 non-null     float64
 2   rastgele_sayi  20 non-null     float64
 3   size           20 non-null     object
 4   normal_sayi    20 non-null     float64
dtypes: datetime64[ns](1), float64(3), object(1)
memory usage: 928.0+ bytes

In [150]:
df6.tail(5)                  # tail (kuyruk) sondan 5 satırı getirir. parametre değeri girilirse o kadar getirir

        tarih  lineer sayi  rastgele_sayi  size  normal_sayi
15 2021-01-16         15.0       0.928297   LOW    93.939757
16 2021-01-17         16.0       0.968378   LOW   105.362962
17 2021-01-18         17.0       0.943751  HIGH    73.083532
18 2021-01-19         18.0       0.427737  HIGH    93.793064
19 2021-01-20         19.0       0.784013  HIGH    88.438203

In [151]:
df6.head()                   # head (baş) sondan 5 satırı getirir. parametre değeri girilirse o kadar getirir

       tarih  lineer sayi  rastgele_sayi    size  normal_sayi
0 2021-01-01          0.0       0.048544    HIGH   104.476331
1 2021-01-02          1.0       0.898854  MEDİUM   103.052792
2 2021-01-03          2.0       0.320343     LOW   103.019406
3 2021-01-04          3.0       0.478690    HIGH    90.197800
4 2021-01-05          4.0       0.300627  MEDİUM   112.133651

In [152]:
# column / columns çağırma

In [153]:
df6["tarih"]                          # sütun çağırmanın esas yontemı budur
# df6.tarih                           # ikinci yöntem. sütun adı python reserve words lerden olursa yada iki kelime olup arası 
                                      # boş olursa hata verir

0    2021-01-01
1    2021-01-02
2    2021-01-03
3    2021-01-04
4    2021-01-05
5    2021-01-06
6    2021-01-07
7    2021-01-08
8    2021-01-09
9    2021-01-10
10   2021-01-11
11   2021-01-12
12   2021-01-13
13   2021-01-14
14   2021-01-15
15   2021-01-16
16   2021-01-17
17   2021-01-18
18   2021-01-19
19   2021-01-20
Name: tarih, dtype: datetime64[ns]

In [154]:
type(df6["tarih"])

pandas.core.series.Series

In [155]:
df6["tarih"].dtype

dtype('<M8[ns]')

In [196]:
df6[["lineer sayi", "rastgele_sayi"]]       # birden fazla istenilen sütunda çağrılabilir

    lineer sayi  rastgele_sayi
0           0.0       0.048544
1           1.0       0.898854
2           2.0       0.320343
3           3.0       0.478690
4           4.0       0.300627
5           5.0       0.934993
6           6.0       0.720346
7           7.0       0.653643
8           8.0       0.026597
9           9.0       0.206372
10         10.0       0.581753
11         11.0       0.672362
12         12.0       0.720456
13         13.0       0.424205
14         14.0       0.219905
15         15.0       0.928297
16         16.0       0.968378
17         17.0       0.943751
18         18.0       0.427737
19         19.0       0.784013

In [200]:
df6[["lineer sayi", "rastgele_sayi"]].head(3)

   lineer sayi  rastgele_sayi
0          0.0       0.048544
1          1.0       0.898854
2          2.0       0.320343

In [198]:
type(df6[["lineer sayi", "rastgele_sayi"]])

pandas.core.frame.DataFrame

In [199]:
df6[["lineer sayi", "rastgele_sayi"]].dtype           # tek sütun olmadığı için dtype hata veriyor

AttributeError: 'DataFrame' object has no attribute 'dtype'

In [156]:
df6["size"].head()

0      HIGH
1    MEDİUM
2       LOW
3      HIGH
4    MEDİUM
Name: size, dtype: object

In [157]:
df6["size"].dtype

dtype('O')

In [158]:
type(df6["size"])

pandas.core.series.Series

In [164]:
df6["normal_sayi"]

0     104.476331
1     103.052792
2     103.019406
3      90.197800
4     112.133651
5      97.372935
6      88.834921
7      96.306157
8     100.646111
9      91.331152
10     84.104568
11     92.607332
12     85.619529
13    110.826395
14    113.047675
15     93.939757
16    105.362962
17     73.083532
18     93.793064
19     88.438203
Name: normal_sayi, dtype: float64

In [160]:
df6["normal_sayi"].dtype

dtype('float64')

In [161]:
type(df6["normal_sayi"])

pandas.core.series.Series

In [162]:
df6.lineer sayi            # iki kelime arasındaki boşluk nedenıyle calısmaz

SyntaxError: invalid syntax (3544366692.py, line 1)

In [163]:
df6.size           # burdada python reserve words lerden biri olduğu için istediğimiz sütunu çağırmıyor başka bir işlem yapıyor

100

In [165]:
df6.tarih.head(2)                   # bir sütunun baştan belirli bir kısmı alınır

0   2021-01-01
1   2021-01-02
Name: tarih, dtype: datetime64[ns]

In [167]:
df6["size"].tail(3)               # bir sütunun sondan belirli bir kısmı alınır

17    HIGH
18    HIGH
19    HIGH
Name: size, dtype: object

In [169]:
df6["size"][5:10]                 # bir sütunun slice yontemıyle belirli bir kısmıda alınır

5    MEDİUM
6       LOW
7       LOW
8       LOW
9    MEDİUM
Name: size, dtype: object

In [ ]:
# column addition

In [170]:
ddd = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
       'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

In [171]:
df7=pd.DataFrame(ddd)

In [172]:
df7

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [175]:
df7["toplam"]=df7["one"]+df7["two"]

In [176]:
df7

   one  two  toplam
a  1.0    1     2.0
b  2.0    2     4.0
c  3.0    3     6.0
d  NaN    4     NaN

In [179]:
df7["ortalama"]=(df7.one+df7.two)/2

In [180]:
df7

   one  two  toplam  ortalama
a  1.0    1     2.0       1.0
b  2.0    2     4.0       2.0
c  3.0    3     6.0       3.0
d  NaN    4     NaN       NaN

In [182]:
data2={"name":pd.Series(["ali", "ayşe", "fatma", "mehmet"]), 
       "yas":pd.Series([25,30,35,40]), 
       "kilo":pd.Series([70,55, 60, 80])}

In [183]:
df77=pd.DataFrame(data2)

In [184]:
df77

     name  yas  kilo
0     ali   25    70
1    ayşe   30    55
2   fatma   35    60
3  mehmet   40    80

In [185]:
df77["endeks"]=df77.yas/df77["kilo"]

In [186]:
df77

     name  yas  kilo    endeks
0     ali   25    70  0.357143
1    ayşe   30    55  0.545455
2   fatma   35    60  0.583333
3  mehmet   40    80  0.500000

In [187]:
data3={"name":pd.Series(["ali", "ayşe", "fatma", "mehmet"]), 
       "boy":pd.Series([1.70, 1.55, 1.60, 1.90]), 
       "kilo":pd.Series([70, 55, 60, 80])}

In [188]:
df777=pd.DataFrame(data3)

In [189]:
df777

     name   boy  kilo
0     ali  1.70    70
1    ayşe  1.55    55
2   fatma  1.60    60
3  mehmet  1.90    80

In [190]:
df777["boykiloendeksi"]=df777.kilo/(df777.boy**2)

In [191]:
df777

     name   boy  kilo  boykiloendeksi
0     ali  1.70    70       24.221453
1    ayşe  1.55    55       22.892820
2   fatma  1.60    60       23.437500
3  mehmet  1.90    80       22.160665

In [201]:
df777[["name", "boykiloendeksi"]]

     name  boykiloendeksi
0     ali       24.221453
1    ayşe       22.892820
2   fatma       23.437500
3  mehmet       22.160665

# del

In [ ]:
# sütunu siler ve kalıcı işlem yapar

In [211]:
data3={"name":pd.Series(["ali", "ayşe", "fatma", "mehmet"]), 
       "boy":pd.Series([1.70, 1.55, 1.60, 1.90]), 
       "kilo":pd.Series([70, 55, 60, 80])}

In [212]:
df8=pd.DataFrame(data3)

In [213]:
df8

     name   boy  kilo
0     ali  1.70    70
1    ayşe  1.55    55
2   fatma  1.60    60
3  mehmet  1.90    80

In [215]:
del df8["boy"]

In [216]:
df8

     name  kilo
0     ali    70
1    ayşe    55
2   fatma    60
3  mehmet    80

#  pop

In [ ]:
 # sütunu siler ve sildiği sütunu döndürür, kalıcı işlem yapar

In [218]:
df8

     name  kilo
0     ali    70
1    ayşe    55
2   fatma    60
3  mehmet    80

In [219]:
df8.pop("kilo")

0    70
1    55
2    60
3    80
Name: kilo, dtype: int64

In [220]:
df8

     name
0     ali
1    ayşe
2   fatma
3  mehmet

# transpose

In [ ]:
# satırlara sütunların yerini değiştirir, kalıcı işlem yapmaz

In [ ]:
data3={"name":pd.Series(["ali", "ayşe", "fatma", "mehmet"]), 
       "boy":pd.Series([1.70, 1.55, 1.60, 1.90]), 
       "kilo":pd.Series([70, 55, 60, 80])}

In [221]:
df9=pd.DataFrame(data3)

In [222]:
df9

     name   boy  kilo
0     ali  1.70    70
1    ayşe  1.55    55
2   fatma  1.60    60
3  mehmet  1.90    80

In [223]:
df9.transpose()

        0     1      2       3
name  ali  ayşe  fatma  mehmet
boy   1.7  1.55    1.6     1.9
kilo   70    55     60      80

In [224]:
df9

     name   boy  kilo
0     ali  1.70    70
1    ayşe  1.55    55
2   fatma  1.60    60
3  mehmet  1.90    80

In [225]:
df9.T                            # T ile de transpose işlemi yapılır

        0     1      2       3
name  ali  ayşe  fatma  mehmet
boy   1.7  1.55    1.6     1.9
kilo   70    55     60      80

In [ ]:
# columns()

# sütun isimlerini döndürür

In [226]:
df9

     name   boy  kilo
0     ali  1.70    70
1    ayşe  1.55    55
2   fatma  1.60    60
3  mehmet  1.90    80

In [227]:
df9.columns

Index(['name', 'boy', 'kilo'], dtype='object')

In [229]:
df9.columns[1]

'boy'

In [230]:
for i in df9.columns:                  # for döngüsü ile columns isimlerini döndürme
    print(i)

name
boy
kilo

In [231]:
import pandas as pd
weather_data = {
    'day': ['1/1/2017','1/2/2017','1/3/2017','1/4/2017','1/5/2017','1/6/2017'],
    'temperature': [32,35,28,24,32,31],
    'windspeed': [6,7,2,7,4,2],
    'event': ['Rain', 'Sunny', 'Snow','Snow','Rain', 'Sunny']
}
df_weather = pd.DataFrame(weather_data)

In [232]:
df_weather

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [233]:
df_weather.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   day          6 non-null      object
 1   temperature  6 non-null      int64
 2   windspeed    6 non-null      int64
 3   event        6 non-null      object
dtypes: int64(2), object(2)
memory usage: 320.0+ bytes

In [234]:
df_weather["rüzgar"]=df_weather.temperature+df_weather.windspeed          # new column

In [235]:
df_weather

        day  temperature  windspeed  event  rüzgar
0  1/1/2017           32          6   Rain      38
1  1/2/2017           35          7  Sunny      42
2  1/3/2017           28          2   Snow      30
3  1/4/2017           24          7   Snow      31
4  1/5/2017           32          4   Rain      36
5  1/6/2017           31          2  Sunny      33

In [ ]:
# value_count()

# seçilen sütunda hangi değerden kaçtane var onu döndürür

In [236]:
bigdf=pd.DataFrame({
    "col1":np.random.choice(["a","b","c"],10**6),
    "col2":np.random.choice(["a","b","c"],10**6),
    "col3":np.random.choice(["a","b","c"],10**6)
    
})

In [237]:
bigdf

       col1 col2 col3
0         c    b    b
1         a    c    b
2         a    a    a
3         b    b    b
4         b    c    b
...     ...  ...  ...
999995    c    b    c
999996    c    b    b
999997    c    c    c
999998    c    a    b
999999    a    a    b

[1000000 rows x 3 columns]

In [238]:
bigdf.head()

  col1 col2 col3
0    c    b    b
1    a    c    b
2    a    a    a
3    b    b    b
4    b    c    b

In [239]:
bigdf.col1.value_counts()

a    334133
c    333319
b    332548
Name: col1, dtype: int64

In [240]:
bigdf["col2"].value_counts()

b    333734
c    333381
a    332885
Name: col2, dtype: int64

In [ ]:
# describe()

# DataFrame in istatistiki değerlerini verir

In [241]:
bigdf.describe()                                     # top : sütunların ilk değerleri

           col1     col2     col3
count   1000000  1000000  1000000
unique        3        3        3
top           a        b        b
freq     334133   333734   333626

In [243]:
df9

     name   boy  kilo
0     ali  1.70    70
1    ayşe  1.55    55
2   fatma  1.60    60
3  mehmet  1.90    80

In [242]:
df9.describe()

            boy       kilo
count  4.000000   4.000000
mean   1.687500  66.250000
std    0.154785  11.086779
min    1.550000  55.000000
25%    1.587500  58.750000
50%    1.650000  65.000000
75%    1.750000  72.500000
max    1.900000  80.000000

In [ ]:
# isin

# sorgulanan değerler DataFrame de varmı yokmu sorgular ve her bir değeri True/False olarak döndürür

In [244]:
bigdf.isin(["a","d"])

         col1   col2   col3
0       False  False  False
1        True  False  False
2        True   True   True
3       False  False  False
4       False  False  False
...       ...    ...    ...
999995  False  False  False
999996  False  False  False
999997  False  False  False
999998  False   True  False
999999   True   True  False

[1000000 rows x 3 columns]

In [245]:
bigdf[bigdf.isin(["a","d"])]        # true ları değer olarak false ları nan yapar

       col1 col2 col3
0       NaN  NaN  NaN
1         a  NaN  NaN
2         a    a    a
3       NaN  NaN  NaN
4       NaN  NaN  NaN
...     ...  ...  ...
999995  NaN  NaN  NaN
999996  NaN  NaN  NaN
999997  NaN  NaN  NaN
999998  NaN    a  NaN
999999    a    a  NaN

[1000000 rows x 3 columns]

In [ ]:
# where

In [250]:
df10=pd.DataFrame(np.arange(10).reshape(-1,2),columns=["a","b"])

In [251]:
df10

   a  b
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [252]:
kural=df10%2!=0

In [253]:
kural

       a     b
0  False  True
1  False  True
2  False  True
3  False  True
4  False  True

In [256]:
df10[kural]

    a  b
0 NaN  1
1 NaN  3
2 NaN  5
3 NaN  7
4 NaN  9

In [259]:
df10.where(kural)

    a  b
0 NaN  1
1 NaN  3
2 NaN  5
3 NaN  7
4 NaN  9

In [260]:
df10.where(kural,df10+1000)           # kurala uymayanları 1000 ile topladı. ters mantık çalışıyor

      a  b
0  1000  1
1  1002  3
2  1004  5
3  1006  7
4  1008  9

In [ ]:
# agg()

In [261]:
df10

   a  b
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [262]:
df10.agg(["min","max","sum"])                  # istatistiksel değerleri verir

      a   b
min   0   1
max   8   9
sum  20  25

In [ ]:
# add_prefix

In [263]:
df10.add_prefix("sütun: ")                     # sütün isimlerine ek isim eklenebiliyor

   sütun: a  sütun: b
0         0         1
1         2         3
2         4         5
3         6         7
4         8         9